In [101]:
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt
%matplotlib inline

### Ввод данных

In [94]:
b1_inventory = pd.read_csv('input/MS-b1-inventory.csv')
b1_inventory.head(n=3)

120

         date  apple   pen
0  2006-01-31  12157   811
1  2006-02-28  29859  2280
2  2006-03-31  42135  3317

In [95]:
b1_sell = pd.read_csv('input/MS-b1-sell.csv')
b1_sell.head(n=3)

         date                                        sku_num
0  2006-01-01  MS-b1-ap-48914c5b-14d2-4b20-bdaf-b2ff5d9f4f0c
1  2006-01-01  MS-b1-ap-6baf7287-3e6a-4728-a3b1-8613de51eef8
2  2006-01-01  MS-b1-ap-83d7b005-c7d9-4deb-93a2-a8f7606d02b5

Считаем, сколько было продано за каждый день яблок и карандашей

In [100]:
b1_sell_upgrade = pd.DataFrame(columns=['date', 'apple', 'pen'])
j = 0
k = 0
l = 0
length = len(b1_sell) - 1
for i in range(length):
   # if i == length - 1:
   #     break
    if b1_sell['sku_num'][i][6] == 'a':
        j = j + 1
    if b1_sell['sku_num'][i][6] == 'p':
        l = l + 1
    if b1_sell['date'][i] != b1_sell['date'][i+1]:
        b1_sell_upgrade.set_value(k, 'apple', j)
        b1_sell_upgrade.set_value(k, 'pen', l)
        b1_sell_upgrade.set_value(k, 'date', b1_sell['date'][i])
        k = k + 1
        j = 0
        l = 0
        
k = k + 1
if b1_sell['sku_num'][length][6] == 'a':
    b1_sell_upgrade.set_value(k, 'apple', j + 1)
if b1_sell['sku_num'][length][6] == 'p':
     b1_sell_upgrade.set_value(k, 'pen', l + 1)
        
b1_sell_upgrade.head(n=5)

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:14: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:15: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  from ipykernel import kernelapp as app
/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:16: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  app.launch_new_instance()
/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:25: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

         date apple  pen
0  2006-01-01  1815  156
1  2006-01-02  1862  143
2  2006-01-03  1880  171
3  2006-01-04  1797  153
4  2006-01-05  1942  133

In [55]:
b1_supply = pd.read_csv('input/MS-b1-supply.csv')
b1_supply.head(n=3)

         date  apple   pen
0  2006-01-01  35086  2730
1  2006-01-15  35002  2625
2  2006-02-01  34963  2759

In [114]:
b1_storage = pd.DataFrame(columns=['date', 'apple', 'pen'])
length_sell = len(b1_sell_upgrade) - 1
length_supply = len(b1_supply) - 1
print (length_supply)
curr_apple = 0
curr_pen = 0
for i in range(length_sell):

    curr_apple = curr_apple - b1_sell_upgrade['apple'][i]
    curr_pen  = curr_pen - b1_sell_upgrade['pen'][i]
    curr_date = b1_sell_upgrade['date'][i]
    for j in range(length_supply):
        if b1_supply['date'][j] == curr_date:
            curr_apple = curr_apple + b1_supply['apple'][j]
            curr_pen = curr_pen + b1_supply['pen'][j]
    b1_storage.set_value(i, 'date', curr_date)
    b1_storage.set_value(i, 'apple', curr_apple)
    b1_storage.set_value(i, 'pen', curr_pen)

239

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:16: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  app.launch_new_instance()
/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:17: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:18: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

In [115]:
b1_storage.head(n=5)

         date  apple   pen
0  2006-01-01  33271  2574
1  2006-01-02  31409  2431
2  2006-01-03  29529  2260
3  2006-01-04  27732  2107
4  2006-01-05  25790  1974